<script setup>
const faqs = [
  {
    name: `วิธีการรักษาโรคของสุรพรรณคลินิกเป็นอย่างไร`,
    description: `สุรพรรณคลินิก รักษาโรคโดยการใช้ตำรับยาสมุนไพร เข้ารักษาที่สาเหตุของโรค เป็นการรักษาแบบองค์รวม ฟื้นฟูทั้งระบบให้กลับมาแข็งแรงทำงานเป็นปกติ`,
  },
  {
    name: `คุณหมอตรวจโรคแบบไหน`,
    description: `คุณหมอจะตรวจรักษาด้วยการจับชีพจร เน้นการรักษาโรคด้วยวิชา "พลังปราณจักระ" ซึ่งเป็นการวินิจฉัยโรคแขนงหนึ่ง การแพทย์แผนตะวันออกเรียกว่า "การตรวจประตูลม" ทางจีนเรียก "แมะ" อินเดียเรียก "กูรูนาดี" ซึ่งเป็นวิธีที่จะทำให้ทราบถึงสาเหตุของโรคว่าอวัยวะส่วนใดที่บกพร่อง จากนั้นจึงนำเอาตำรับยาที่มีอยู่กว่า 30 ตำรับ มาทำการรักษาโดยมุ่งเน้นการรักษาที่สาเหตุของโรค`,
  },
  {
    name: `หากผู้ป่วยไม่สามารถเดินทางมาพบคุณหมอได้`,
    description: `ญาติสามารถนำผลตรวจของผู้ป่วย และยาแผนปัจจุบันที่ผู้ป่วยรับประทานอยู่มาปรึกษาคุณหมอแทนได้`,
  },
  {
    name: `ผู้หญิงที่ตั้งครรภ์สามารถรับประทานยาสมุนไพรได้หรือไม่`,
    description: `ผู้หญิงที่ตั้งครรภ์สามารถทานยาสมุนไพรของคลินิกได้ คุณหมอจะจัดยาที่เหมาะสมและบำรุงครรภ์ให้ด้วย`,
  },
  {
    name: `เอายาให้คนอื่นกินได้ไหม หากมีอาการป่วยเหมือนกัน`,
    description: `แม้ว่าผู้ป่วยจะมีอาการที่เหมือนกัน แต่อาจเกิดจากสาเหตุที่ต่างกัน ผู้ป่วยควรมาพบคุณหมอเพื่อทำการตรวจวินิจฉัยอาการ และจ่ายยาที่เป็นประโยชน์ตรงกับการดูแลสุขภาพมากที่สุด`,
  },
  {
    name: `การรักษาโรคด้วยยาสมุนไพรใช้เวลานานแค่ไหน`,
    description: `แม้ว่าคนไข้ที่ป่วยด้วยโรคเดียวกัน ระยะเวลาการรักษาของแต่ละคนก็จะแตกต่างกัน ทั้งนี้ขึ้นอยู่กับปัจจัยเรื่องอายุ การรับประทานอาหาร การพักผ่อน การออกกำลังกาย อาการแทรกซ้อนอื่นๆ หรือแม้กระทั่งไลฟ์สไตล์ การใช้ชีวิตประจำวัน ล้วนมีผลต่อการฟื้นฟูสุขภาพทั้งสิ้น ผู้ป่วยสามารถสอบถามคุณหมอเพื่อประเมินอาการในวันที่เข้ารับการตรวจได้`,
  },
  {
    name: `รักษาด้วยยาสมุนไพร ทำไมค่ารักษาสูง`,
    description: `ตำรับยาสมุนไพรของอาจารย์สุรพรรณ ศิริธรรมวานิช เป็นตำรับยาสมุนไพรที่ประกอบด้วยกลุ่มยาหัวหน้า ยาคุมฤทธิ์ ยาช่วยฤทธิ์ ยานำทางเข้าสู่อวัยวะภายใน ตำรับยาประกอบด้วยสมุนไพรไทย และ สมุนไพรจีน คุณภาพสูงหลายสิบชนิด อีกทั้งยังนำตัวยาเหล่านั้นไปสกัดด้วยอัตราส่วน 50 : 1 ด้วยกรรมวิธีสเปรย์ดราย และทำการฆ่าเชื้อด้วยคลื่นแม่เหล็กไฟฟ้า เพื่อให้มีประสิทธิภาพในการรักษาสูงขึ้น จึงทำให้มีต้นทุนสูงกว่าทั่วไป`,
  },
  {
    name: `การรักษาด้วยยาสมุนไพรของสุรพรรณคลินิก สามารถรักษาโรคอะไรได้บ้าง`,
    description: `สุรพรรณคลินิก รักษาโรคเรื้อรังทุกระดับต่อเนื่องยาวนานกว่า 60 ปี โดยการฟื้นฟูร่างกายแบบองค์รวมทั้งระบบ เน้นการรักษาที่สาเหตุของโรค ไม่กดซ่อนอาการ การรักษาเช่นนี้นอกจากหายจากโรคที่เป็นอยู่อวัยวะที่อยู่ในระบบเดียวกันซึ่งอาจจะทรุดโทรมเกี่ยวเนื่องจากอาการป่วย จะได้รับการฟื้นฟูให้กลับมาแข็งแรง ทำงานเป็นปกติควบคู่กันอีกด้วย`,
  },
  {
    name: `หากรักษาจนหายแล้วหยุดรับประทานยา จะสามารถกลับมาป่วยด้วยโรคเดิมได้อีกหรือไม่`,
    description: `เมื่อหายจากอาการป่วยแล้ว สามารถหยุดรับประทานยาได้ ไม่กลับมาป่วยโรคเดิมอีก แต่เมื่อหยุดรับประทานยาแล้ว ต้องมีวินัยในการรักษาสุขภาพของตนเอง ดูแลเรื่องอาหาร การพักผ่อน ระวังความเครียด ออกกำลังกายอย่างเหมาะสมสม่ำเสมอ ไม่กลับไปใช้ชิวิตในลักษณะที่เสี่ยงให้เกิดโรค เพราะการละเลยการดูแลสุขภาพเป็นสาเหตุที่ทำให้เกิดโรคได้ในทุกคนอยู่แล้ว`,
  },
];
</script>

<template>
  <Container>
    <FlexY class="pb-10">
      <TextTitle>คำถามที่พบบ่อยกับ "สุรพรรณคลินิก"</TextTitle>

      <Collaspe v-for="(item, index) in faqs" :key="index">
        <template #title>
          {{ item.name }}
        </template>
        <template #text-body>
          {{ item.description }}
        </template>
      </Collaspe>

      <ContactContainer />
    </FlexY>
  </Container>
</template>
